---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomFinishWall
source: html/23af099b-255d-e139-1152-c2608ecfa64e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomFinishWall Property

"Wall Finish"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomFinishWall { get; }
```